БухЭксп/Catalogs/CW_ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ВидыКонтактнойИнформации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипКИ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ВидыКонтактнойИнформации/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_ПраваДоступа.УстановитьПраваДляФормы(ЭтаФорма);
	//_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипКИПриИзменении(Элемент)
	
	Если (НЕ ЗначениеЗаполнено(Объект.Наименование)) Тогда
		
		Объект.Наименование = Строка(Объект.ТипКИ);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВидыКонтактнойИнформации.Ссылка
	               |ИЗ
	               |	Справочник.CW_ВидыКонтактнойИнформации КАК CW_ВидыКонтактнойИнформации
	               |ГДЕ
	               |	CW_ВидыКонтактнойИнформации.Основной = ИСТИНА
	               |	И CW_ВидыКонтактнойИнформации.ТипКИ = &ТипКИ
	               |	И CW_ВидыКонтактнойИнформации.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("ТипКИ", Объект.ТипКИ);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка); 
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если (Объект.Основной) Тогда
		
		Если (ТЗ.Количество() <> 0) Тогда
			
			Для каждого Стр Из ТЗ Цикл
				
				СтрО = Стр.Ссылка.ПолучитьОбъект();
				СтрО.Основной = ЛОжь;
				СтрО.Записать();
				
			КонецЦикла; 
			
		КонецЕсли; 		
		
	Иначе
		
		Если (ТЗ.Количество() = 0) Тогда
			
			ТекущийОбъект.Основной = Истина;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти
